import time
start = time.time()
# ----------------------------------------
import sys
sys.stdin = open('input.txt')
input = sys.stdin.readline
write = sys.stdout.write

# 0. 입력
S = input().strip() # 문자열
q = int(input()) # 질문개수

# 1. 누적합 배열 생성
prefix = [[0] * 26 for _ in range(len(S) + 1)]
'''
- 열 : 알파벳 a 부터 z 까지 (26개)
- 행 : 문자열 0번부터 -1번까지 (원래는 len(S)개)
- [:r] 범위 계산 편하게 하기 위해서 len(S)+1 로 패딩 (0행 스킵)
'''

# 2. 누적합 채우기
for i in range(len(S)):
    prefix[i+1] = prefix[i][:]
    prefix[i+1][ord(S[i]) - ord('a')] += 1
'''
- 문자열 순회하며 0행은 스킵하고 1행부터 작업
- 문자열 순회할때마다 [abcdefghijklmnopqrstuvwxyz] 에 표시
- 알파벳은 아스키 자료형이므로, ord()로 숫자로 전환할 수 있고
'a'= 97 인지 몰라도 ord('a') 를 빼면 몇번째 열에 표시해야하는지 알 수 있음
'''
'''
- 예시 'add' 일때
1차 회전
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

2차 회전
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

3차 회전
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
[1, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
'''

# 3. 쿼리 처리
for _ in range(q):
    a, l, r = input().split()
    l, r = int(l), int(r) # 문자로 받아서 숫자로 전환
    idx = ord(a) - ord('a') # 찾으려는 알파벳도 숫자로 전환
    write(str(prefix[r+1][idx] - prefix[l][idx])+'\n') # 패딩행 고려해서 개수계산

# ----------------------------------------
end = time.time()
write(str(end-start) + '초')